<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>Today is a new day</title>
  <subtitle>Carrot&#39;s Tech Blog</subtitle>
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://yoursite.com/"/>
  <updated>2016-05-30T03:19:38.029Z</updated>
  <id>http://yoursite.com/</id>
  
  <author>
    <name>carrot</name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>十个深度学习概念</title>
    <link href="http://yoursite.com/2016/05/30/Ten-Deep-Learning-Terms/"/>
    <id>http://yoursite.com/2016/05/30/Ten-Deep-Learning-Terms/</id>
    <published>2016-05-30T03:12:10.000Z</published>
    <updated>2016-05-30T03:19:38.029Z</updated>
    
    <content type="html">&lt;h3 id=&quot;&amp;#x611F;&amp;#x77E5;&amp;#x5668;&amp;#xFF08;Perceptron&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x611F;&amp;#x77E5;&amp;#x5668;&amp;#xFF08;Perceptron&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x611F;&amp;#x77E5;&amp;#x5668;&amp;#xFF08;Perceptron&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x611F;&amp;#x77E5;&amp;#x5668;&amp;#xFF08;Perceptron&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x5728;&amp;#x4EBA;&amp;#x8111;&amp;#x4E2D;&amp;#xFF0C;&amp;#x795E;&amp;#x7ECF;&amp;#x5143;&amp;#x662F;&amp;#x7528;&amp;#x4E8E;&amp;#x5904;&amp;#x7406;&amp;#x548C;&amp;#x4F20;&amp;#x9012;&amp;#x4FE1;&amp;#x606F;&amp;#x7684;&amp;#x7EC6;&amp;#x80DE;&amp;#x3002;&amp;#x611F;&amp;#x77E5;&amp;#x673A;&amp;#x53EF;&amp;#x4EE5;&amp;#x8BA4;&amp;#x4E3A;&amp;#x662F;&amp;#x751F;&amp;#x7269;&amp;#x795E;&amp;#x7ECF;&amp;#x5143;&amp;#x7684;&amp;#x975E;&amp;#x5E38;&amp;#x7B80;&amp;#x5316;&amp;#x7684;&amp;#x7248;&amp;#x672C;&amp;#x3002;&lt;br&gt;&amp;#x611F;&amp;#x77E5;&amp;#x5668;&amp;#x53EF;&amp;#x4EE5;&amp;#x5904;&amp;#x7406;&amp;#x7EAA;&amp;#x5F55;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x52A0;&amp;#x6743;&amp;#x5904;&amp;#x7406;&amp;#xFF0C;&amp;#x7ED9;&amp;#x51FA;&amp;#x4E00;&amp;#x8DEF;&amp;#x8F93;&amp;#x51FA;&amp;#x3002;&amp;#x6BCF;&amp;#x4E00;&amp;#x8DEF;&amp;#x8F93;&amp;#x5165;&amp;#x7684;&amp;#x6743;&amp;#x91CD;&amp;#x53D6;&amp;#x51B3;&amp;#x4E8E;&amp;#x5BF9;&amp;#x4E8E;&amp;#x8F93;&amp;#x51FA;&amp;#x7684;&amp;#x91CD;&amp;#x8981;&amp;#x6027;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x4EBA;&amp;#x5DE5;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Artificial-Neural-Networks&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x4EBA;&amp;#x5DE5;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Artificial-Neural-Networks&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x4EBA;&amp;#x5DE5;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Artificial Neural Networks&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x4EBA;&amp;#x5DE5;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Artificial Neural Networks&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x4EBA;&amp;#x5DE5;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;ANN&amp;#xFF09;&amp;#x662F;&amp;#x5EFA;&amp;#x6A21;&amp;#x81EA;&amp;#x751F;&amp;#x7269;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;#x751F;&amp;#x7269;&amp;#x7684;&amp;#x4E2D;&amp;#x592E;&amp;#x795E;&amp;#x7ECF;&amp;#x7CFB;&amp;#x7EDF;&amp;#x548C;&amp;#x4EBA;&amp;#x7C7B;&amp;#x7684;&amp;#x5927;&amp;#x8111;&amp;#x3002;&lt;br&gt;&amp;#x4EBA;&amp;#x5DE5;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x662F;&amp;#x5904;&amp;#x7406;&amp;#x88C5;&amp;#x7F6E;&amp;#xFF0C;&amp;#x7C7B;&amp;#x4F3C;&amp;#x4E8E;&amp;#x5C0F;&amp;#x89C4;&amp;#x6A21;&amp;#x7684;&amp;#x677E;&amp;#x6563;&amp;#x5730;&amp;#x5EFA;&amp;#x6A21;&amp;#x4E8E;&amp;#x54FA;&amp;#x4E73;&amp;#x52A8;&amp;#x7269;&amp;#x5927;&amp;#x8111;&amp;#x76AE;&amp;#x5C42;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#x6216;&amp;#x8005;&amp;#x7269;&amp;#x7406;&amp;#x786C;&amp;#x4EF6;&amp;#x3002;&lt;br&gt;&amp;#x6211;&amp;#x4EEC;&amp;#x53EF;&amp;#x4EE5;&amp;#x79F0;&amp;#x547C;&amp;#x5B83;&amp;#x4E3A;&amp;#x4EBA;&amp;#x8111;&amp;#x7684;&amp;#x7B80;&amp;#x5355;&amp;#x8BA1;&amp;#x7B97;&amp;#x6A21;&amp;#x578B;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x5411;&amp;#x540E;&amp;#x4F20;&amp;#x64AD;&amp;#xFF08;Backpropagation&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x5411;&amp;#x540E;&amp;#x4F20;&amp;#x64AD;&amp;#xFF08;Backpropagation&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x5411;&amp;#x540E;&amp;#x4F20;&amp;#x64AD;&amp;#xFF08;Backpropagation&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x5411;&amp;#x540E;&amp;#x4F20;&amp;#x64AD;&amp;#xFF08;Backpropagation&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x6A21;&amp;#x578B;&amp;#x8BAD;&amp;#x7EC3;&amp;#x5E38;&amp;#x7528;&amp;#x7684;&amp;#x4E00;&amp;#x79CD;&amp;#x7B97;&amp;#x6CD5;&amp;#x662F;&amp;#x5411;&amp;#x540E;&amp;#x4F20;&amp;#x64AD;&amp;#x7B97;&amp;#x6CD5;&amp;#x3002;&amp;#x8BAD;&amp;#x7EC3;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x4F1A;&amp;#x5148;&amp;#x7ED9;&amp;#x5B9A;&amp;#x4E00;&amp;#x7EC4;&amp;#x8F93;&amp;#x5165;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4F1A;&amp;#x4EA7;&amp;#x54C1;&amp;#x4E00;&amp;#x5B9A;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#x3002;&amp;#x8BAD;&amp;#x7EC3;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B65;&amp;#x662F;&amp;#x544A;&amp;#x8BC9;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x8FD9;&amp;#x6837;&amp;#x7684;&amp;#x8F93;&amp;#x5165;&amp;#x83B7;&amp;#x5F97;&amp;#x8FD9;&amp;#x6837;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#x662F;&amp;#x6B63;&amp;#x786E;&amp;#x7684;&amp;#xFF0C;&amp;#x7406;&amp;#x60F3;&amp;#x7684;&amp;#x3002;&amp;#x4EBA;&amp;#x5DE5;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x6839;&amp;#x636E;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7406;&amp;#x60F3;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#x6765;&amp;#x8C03;&amp;#x6574;&amp;#x5404;&amp;#x9879;&amp;#x6743;&amp;#x91CD;&amp;#xFF0C;&amp;#x4F7F;&amp;#x5F97;&amp;#x4E0B;&amp;#x6B21;&amp;#x83B7;&amp;#x5F97;&amp;#x76F8;&amp;#x4F3C;&amp;#x8F93;&amp;#x5165;&amp;#x65F6;&amp;#x53EF;&amp;#x4EE5;&amp;#x83B7;&amp;#x5F97;&amp;#x66F4;&amp;#x51C6;&amp;#x786E;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#xFF08;&amp;#x53D6;&amp;#x51B3;&amp;#x4E8E;&amp;#x4ED6;&amp;#x4EEC;&amp;#x5BF9;&amp;#x4E8E;&amp;#x6574;&amp;#x4E2A;&amp;#x9884;&amp;#x6D4B;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x8D21;&amp;#x732E;&amp;#xFF09;&amp;#x3002;&lt;br&gt;&amp;#x6574;&amp;#x4E2A;&amp;#x8FC7;&amp;#x7A0B;&amp;#x4F1A;&amp;#x53CD;&amp;#x590D;&amp;#x8FDB;&amp;#x884C;&amp;#x76F4;&amp;#x5230;&amp;#x8F93;&amp;#x5165;&amp;#x548C;&amp;#x7406;&amp;#x60F3;&amp;#x8F93;&amp;#x51FA;&amp;#x95F4;&amp;#x7684;&amp;#x8BEF;&amp;#x5DEE;&amp;#x662F;&amp;#x53EF;&amp;#x4EE5;&amp;#x63A5;&amp;#x53D7;&amp;#x7684;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Convolutional-Neural-Networks&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Convolutional-Neural-Networks&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Convolutional Neural Networks&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Convolutional Neural Networks&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x53EF;&amp;#x4EE5;&amp;#x88AB;&amp;#x8BA4;&amp;#x4E3A;&amp;#x662F;&amp;#x7531;&amp;#x5927;&amp;#x91CF;&amp;#x76F8;&amp;#x540C;&amp;#x795E;&amp;#x7ECF;&amp;#x5143;&amp;#x590D;&amp;#x5236;&amp;#x5F97;&amp;#x5230;&amp;#x7684;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x3002;&amp;#x8FD9;&amp;#x4F7F;&amp;#x5F97;&amp;#x7F51;&amp;#x7EDC;&amp;#x53EA;&amp;#x9700;&amp;#x8981;&amp;#x5B66;&amp;#x4E60;&amp;#x4E00;&amp;#x4E2A;&amp;#x795E;&amp;#x7ECF;&amp;#x5143;&amp;#x4E00;&amp;#x6B21;&amp;#xFF0C;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x5728;&amp;#x8BB8;&amp;#x591A;&amp;#x5730;&amp;#x65B9;&amp;#x5E94;&amp;#x7528;&amp;#xFF0C;&amp;#x7B80;&amp;#x5316;&amp;#x4E86;&amp;#x6A21;&amp;#x578B;&amp;#x8BAD;&amp;#x7EC3;&amp;#x8FC7;&amp;#x7A0B;&amp;#xFF0C;&amp;#x5E76;&amp;#x51CF;&amp;#x5C11;&amp;#x4E86;&amp;#x8BEF;&amp;#x5DEE;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x5728;&amp;#x7279;&amp;#x522B;&amp;#x9002;&amp;#x5408;&amp;#x5E94;&amp;#x7528;&amp;#x4E8E;&amp;#x7269;&amp;#x4F53;&amp;#x8BC6;&amp;#x522B;&amp;#x548C;&amp;#x56FE;&amp;#x50CF;&amp;#x6807;&amp;#x6CE8;&amp;#x3002;&lt;br&gt;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x4E0D;&amp;#x65AD;&amp;#x5B66;&amp;#x4E60;&amp;#x8F93;&amp;#x5165;&amp;#x7684;&amp;#x5377;&amp;#x79EF;&amp;#x62BD;&amp;#x8C61;&amp;#x8868;&amp;#x8FBE;&amp;#x3002;&amp;#x5728;&amp;#x4EE5;&amp;#x4E0B;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7269;&amp;#x4F53;&amp;#x8BC6;&amp;#x522B;&amp;#x4F8B;&amp;#x5B50;&amp;#x4E2D;&amp;#xFF0C;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x4ECE;&amp;#x5B66;&amp;#x4E60;&amp;#x50CF;&amp;#x7D20;&amp;#x6570;&amp;#x636E;&amp;#x5F00;&amp;#x59CB;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x5B66;&amp;#x4E60;&amp;#x53EF;&amp;#x533A;&amp;#x5206;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;#x8FB9;&amp;#x7F18;&amp;#xFF0C;&amp;#x57FA;&amp;#x672C;&amp;#x5F62;&amp;#x72B6;&amp;#xFF0C;&amp;#x590D;&amp;#x6742;&amp;#x5F62;&amp;#x72B6;&amp;#xFF0C;&amp;#x6A21;&amp;#x5F0F;&amp;#x548C;&amp;#x7EB9;&amp;#x7406;&amp;#x3002;&lt;br&gt;&lt;img src=&quot;/2016/05/30/Ten-Deep-Learning-Terms/Ten_Deep_Learning_Terms/10DLT-CNN.png&quot; alt=&quot;CNN&quot;&gt;&lt;br&gt;&amp;#x6765;&amp;#x81EA;: &lt;a href=&quot;http://stats.stackexchange.com/questions/146413&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;http://stats.stackexchange.com/questions/146413&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x65F6;&amp;#x95F4;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Recurrent-Neural-Network&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x65F6;&amp;#x95F4;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Recurrent-Neural-Network&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x65F6;&amp;#x95F4;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Recurrent Neural Network&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x65F6;&amp;#x95F4;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Recurrent Neural Network&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7528;&amp;#x4E8E;&amp;#x5904;&amp;#x7406;&amp;#x8FDE;&amp;#x7EED;&amp;#x4FE1;&amp;#x53F7;&amp;#x3002;&amp;#x548C;&amp;#x4F20;&amp;#x7EDF;&amp;#x7684;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x8BA4;&amp;#x4E3A;&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x8F93;&amp;#x5165;&amp;#x548C;&amp;#x8F93;&amp;#x51FA;&amp;#x95F4;&amp;#x662F;&amp;#x76F8;&amp;#x4E92;&amp;#x72EC;&amp;#x7ACB;&amp;#x7684;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x4F9D;&amp;#x8D56;&amp;#x4E8E;&amp;#x4E4B;&amp;#x524D;&amp;#x7684;&amp;#x8BA1;&amp;#x7B97;&amp;#x3002;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x662F;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x5728;&amp;#x65F6;&amp;#x95F4;&amp;#x4E0A;&amp;#x7684;&amp;#x5C55;&amp;#x5F00;&amp;#x3002;&amp;#x4F20;&amp;#x7EDF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x53EF;&amp;#x4EE5;&amp;#x6709;&amp;#x4E0D;&amp;#x540C;&amp;#x5C42;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;RNN&amp;#x5728;&amp;#x6BCF;&amp;#x4E2A;&amp;#x65F6;&amp;#x95F4;&amp;#x70B9;&amp;#x53EA;&amp;#x6709;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x5C42;&amp;#xFF0C;&amp;#x5E76;&amp;#x5C06;&amp;#x8F93;&amp;#x51FA;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E0B;&amp;#x4E00;&amp;#x4E2A;&amp;#x65F6;&amp;#x95F4;&amp;#x70B9;&amp;#x7684;&amp;#x8F93;&amp;#x5165;&amp;#x3002;RNN&amp;#x4E2D;&amp;#x5B9E;&amp;#x4F53;&amp;#x95F4;&amp;#x7684;&amp;#x8FDE;&amp;#x63A5;&amp;#x5F62;&amp;#x6210;&amp;#x4E00;&amp;#x4E2A;&amp;#x5B9A;&amp;#x5411;&amp;#x5468;&amp;#x671F;&amp;#xFF0C;&amp;#x5F62;&amp;#x6210;&amp;#x4E00;&amp;#x5B9A;&amp;#x7684;&amp;#x5185;&amp;#x90E8;&amp;#x8BB0;&amp;#x5FC6;&amp;#xFF0C;&amp;#x5E2E;&amp;#x52A9;&amp;#x6A21;&amp;#x578B;&amp;#x5904;&amp;#x7406;&amp;#x957F;&amp;#x957F;&amp;#x7684;&amp;#x4F9D;&amp;#x8D56;&amp;#x94FE;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x7ED3;&amp;#x6784;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Recursive-Neural-Network&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x7ED3;&amp;#x6784;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Recursive-Neural-Network&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x7ED3;&amp;#x6784;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Recursive Neural Network&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x7ED3;&amp;#x6784;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Recursive Neural Network&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x7ED3;&amp;#x6784;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x662F;&amp;#x65F6;&amp;#x95F4;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x63A8;&amp;#x5E7F;&amp;#x5E94;&amp;#x7528;&amp;#xFF0C;&amp;#x5B83;&amp;#x662F;&amp;#x4E00;&amp;#x7CFB;&amp;#x5217;&amp;#x4E0D;&amp;#x53D8;&amp;#x7684;&amp;#x6743;&amp;#x91CD;&amp;#x7CFB;&amp;#x6570;&amp;#x590D;&amp;#x5236;&amp;#x6216;&amp;#x8005;&amp;#x9012;&amp;#x5F52;&amp;#x5E94;&amp;#x7528;&amp;#x4E8E;&amp;#x7ED3;&amp;#x6784;&amp;#x4E0A;&amp;#x800C;&amp;#x5F62;&amp;#x6210;&amp;#x3002;&amp;#x7ED3;&amp;#x6784;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x53EF;&amp;#x4EE5;&amp;#x8868;&amp;#x793A;&amp;#x6210;&amp;#x6811;&amp;#x5F62;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x800C;&amp;#x65F6;&amp;#x95F4;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x65F6;&amp;#x5E8F;&amp;#x94FE;&amp;#x3002;&amp;#x7ED3;&amp;#x6784;&amp;#x9012;&amp;#x5F52;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x53EF;&amp;#x7528;&amp;#x4E8E;&amp;#x89E3;&amp;#x51B3;&amp;#x81EA;&amp;#x7136;&amp;#x8BED;&amp;#x8A00;&amp;#x7406;&amp;#x89E3;&amp;#x4E2D;&amp;#x4E00;&amp;#x4E9B;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x5982;&amp;#x8BED;&amp;#x4E49;&amp;#x60C5;&amp;#x611F;&amp;#x5206;&amp;#x6790;&amp;#x3002;&lt;br&gt;&lt;img src=&quot;/2016/05/30/Ten-Deep-Learning-Terms/Ten_Deep_Learning_Terms/10DLT-RNN.png&quot; alt=&quot;RNN&quot;&gt;&lt;br&gt;&amp;#x6765;&amp;#x81EA;: &lt;a href=&quot;http://nlp.stanford.edu/~socherr/EMNLP2013_RNTN.pdf&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;http://nlp.stanford.edu/~socherr/EMNLP2013_RNTN.pdf&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;-&amp;#xFF08;Supervised-Neural-Network&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;-&amp;#xFF08;Supervised-Neural-Network&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC; &amp;#xFF08;Supervised Neural Network&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC; &amp;#xFF08;Supervised Neural Network&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x60F3;&amp;#x8981;&amp;#x83B7;&amp;#x5F97;&amp;#x4E00;&amp;#x4E2A;&amp;#x7406;&amp;#x60F3;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#xFF0C;&amp;#x5FC5;&amp;#x987B;&amp;#x4E4B;&amp;#x524D;&amp;#x6709;&amp;#x7ED9;&amp;#x5B9A;&amp;#x4E00;&amp;#x4E2A;&amp;#x51C6;&amp;#x786E;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#x3002;&amp;#x201C;&amp;#x8BAD;&amp;#x7EC3;&amp;#x201D;&amp;#x662F;&amp;#x57FA;&amp;#x4E8E;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E8B;&amp;#x5148;&amp;#x5B9A;&amp;#x4E49;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x5408;&amp;#xFF0C;&amp;#x57FA;&amp;#x4E8E;&amp;#x8FD9;&amp;#x4E2A;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x5408;&amp;#xFF0C;&amp;#x5728;&amp;#x7ED9;&amp;#x5B9A;&amp;#x8F93;&amp;#x5165;&amp;#x65F6;&amp;#x4EA7;&amp;#x751F;&amp;#x51C6;&amp;#x786E;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x7C7B;&amp;#x4F3C;&amp;#x4E8E;&amp;#x5DF2;&amp;#x7ECF;&amp;#x7ED9;&amp;#x51FA;&amp;#x4E86;&amp;#x95EE;&amp;#x9898;&amp;#x548C;&amp;#x7406;&amp;#x60F3;&amp;#x56DE;&amp;#x7B54;&amp;#x7684;&amp;#x5B66;&amp;#x4E60;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x65E0;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;-&amp;#xFF08;Unsupervised-Neural-Network&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x65E0;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;-&amp;#xFF08;Unsupervised-Neural-Network&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x65E0;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC; &amp;#xFF08;Unsupervised Neural Network&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x65E0;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC; &amp;#xFF08;Unsupervised Neural Network&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x65E0;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x9700;&amp;#x8981;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x6216;&amp;#x8005;&amp;#x673A;&amp;#x5236;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x81EA;&amp;#x52A8;&amp;#x5728;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E8B;&amp;#x5148;&amp;#x6CA1;&amp;#x6709;&amp;#x8BAD;&amp;#x7EC3;&amp;#x8FC7;&amp;#x7684;&amp;#x6CA1;&amp;#x6709;&amp;#x6807;&amp;#x8BB0;&amp;#x8FC7;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x5408;&amp;#x4E2D;&amp;#x8FD0;&amp;#x7528;&amp;#x805A;&amp;#x7C7B;&amp;#x7B97;&amp;#x6CD5;&amp;#x81EA;&amp;#x52A8;&amp;#x53D1;&amp;#x73B0;&amp;#x6A21;&amp;#x5F0F;&amp;#x548C;&amp;#x503E;&amp;#x5411;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x68AF;&amp;#x5EA6;&amp;#x4E0B;&amp;#x964D;&amp;#xFF08;Gradient-Descent&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x68AF;&amp;#x5EA6;&amp;#x4E0B;&amp;#x964D;&amp;#xFF08;Gradient-Descent&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x68AF;&amp;#x5EA6;&amp;#x4E0B;&amp;#x964D;&amp;#xFF08;Gradient Descent&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x68AF;&amp;#x5EA6;&amp;#x4E0B;&amp;#x964D;&amp;#xFF08;Gradient Descent&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x68AF;&amp;#x5EA6;&amp;#x4E0B;&amp;#x964D;&amp;#x6CD5;&amp;#x662F;&amp;#x5BFB;&amp;#x627E;&amp;#x51FD;&amp;#x6570;&amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x5C0F;&amp;#x503C;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#x3002;&amp;#x7B97;&amp;#x6CD5;&amp;#x5148;&amp;#x731C;&amp;#x6D4B;&amp;#x4E00;&amp;#x4E2A;&amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x5C0F;&amp;#x503C;&amp;#x7684;&amp;#x70B9;&amp;#xFF0C;&amp;#x8BA1;&amp;#x7B97;&amp;#x68AF;&amp;#x5EA6;&amp;#xFF0C;&amp;#x5E76;&amp;#x6CBF;&amp;#x7740;&amp;#x68AF;&amp;#x5EA6;&amp;#x8D1F;&amp;#x65B9;&amp;#x5411;&amp;#x53CD;&amp;#x590D;&amp;#x4F7F;&amp;#x7528;&amp;#x68AF;&amp;#x5EA6;&amp;#x7B97;&amp;#x6CD5;&amp;#x76F4;&amp;#x5230;&amp;#x627E;&amp;#x5230;&amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x5C0F;&amp;#x503C;&amp;#xFF0C;&amp;#x5373;&amp;#x7B97;&amp;#x6CD5;&amp;#x6700;&amp;#x7EC8;&amp;#x6536;&amp;#x655B;&amp;#x4E8E;&amp;#x68AF;&amp;#x5EA6;&amp;#x4E3A;0&amp;#x7684;&amp;#x70B9;&amp;#x3002;&amp;#x6211;&amp;#x4EEC;&amp;#x5176;&amp;#x5B9E;&amp;#x662F;&amp;#x5728;&amp;#x6CBF;&amp;#x7740;&amp;#x8BEF;&amp;#x5DEE;&amp;#x8868;&amp;#x9762;&amp;#x4E0B;&amp;#x964D;&amp;#xFF0C;&amp;#x76F4;&amp;#x5230;&amp;#x5230;&amp;#x8FBE;&amp;#x8C37;&amp;#x5E95;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x5B57;&amp;#x5D4C;&amp;#x5165;&amp;#xFF08;Word-Embedding&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x5B57;&amp;#x5D4C;&amp;#x5165;&amp;#xFF08;Word-Embedding&amp;#xFF09;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x5B57;&amp;#x5D4C;&amp;#x5165;&amp;#xFF08;Word Embedding&amp;#xFF09;&quot;&gt;&lt;/a&gt;&amp;#x5B57;&amp;#x5D4C;&amp;#x5165;&amp;#xFF08;Word Embedding&amp;#xFF09;&lt;/h3&gt;&lt;p&gt;&amp;#x5C31;&amp;#x50CF;&amp;#x4E00;&amp;#x5E45;&amp;#x753B;&amp;#x4F5C;&amp;#x53EF;&amp;#x4EE5;&amp;#x4EE3;&amp;#x8868;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#xFF0C;&amp;#x5B57;&amp;#x5D4C;&amp;#x5165;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x5355;&amp;#x8BCD;&amp;#x7684;&amp;#x6570;&amp;#x5B57;&amp;#x8868;&amp;#x5F81;&amp;#x3002;&amp;#x5B57;&amp;#x5D4C;&amp;#x5165;&amp;#x7ECF;&amp;#x8FC7;&amp;#x8BAD;&amp;#x7EC3;&amp;#xFF0C;&amp;#x7528;&amp;#x6765;&amp;#x8BA1;&amp;#x7B97;&amp;#x5355;&amp;#x8BCD;&amp;#x95F4;&amp;#x7684;&amp;#x76F8;&amp;#x4F3C;&amp;#x5EA6;&amp;#x3002;&amp;#x662F;&amp;#x8BA1;&amp;#x7B97;&amp;#x673A;&amp;#x80FD;&amp;#x591F;&amp;#x7406;&amp;#x89E3;&amp;#x7684;&amp;#x5355;&amp;#x8BCD;&amp;#x7684;&amp;#x8BED;&amp;#x4E49;&amp;#x548C;&amp;#x8BED;&amp;#x6CD5;&amp;#x7684;&amp;#x6570;&amp;#x5B57;&amp;#x8868;&amp;#x8FBE;&amp;#x3002;&lt;br&gt;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8FC7;&amp;#x7A0B;&amp;#x4E2D;&amp;#x521B;&amp;#x5EFA;&amp;#x7684;&amp;#x5355;&amp;#x8BCD;&amp;#x5411;&amp;#x91CF;&amp;#x80FD;&amp;#x83B7;&amp;#x5F97;&amp;#x770B;&amp;#x8D77;&amp;#x6765;&amp;#x611F;&amp;#x89C9;&amp;#x5F88;&amp;#x795E;&amp;#x5947;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;#xFF0C;&amp;#x4ECE;&amp;#x201C;&amp;#x56FD;&amp;#x738B;&amp;#x201D;&amp;#x7684;&amp;#x5411;&amp;#x91CF;&amp;#x4E2D;&amp;#x51CF;&amp;#x53BB;&amp;#x201C;&amp;#x7537;&amp;#x4EBA;&amp;#x201D;&amp;#x7684;&amp;#x5411;&amp;#x91CF;&amp;#x7684;&amp;#x7ED3;&amp;#x679C;&amp;#x4F1A;&amp;#x8FD1;&amp;#x4F3C;&amp;#x76F8;&amp;#x7B49;&amp;#x4E8E;&amp;#x201C;&amp;#x738B;&amp;#x540E;&amp;#x201D;&amp;#x4E2D;&amp;#x51CF;&amp;#x53BB;&amp;#x201C;&amp;#x5973;&amp;#x4EBA;&amp;#x201D;&amp;#x3002;&amp;#x66F4;&amp;#x6709;&amp;#x610F;&amp;#x601D;&amp;#x7684;&amp;#x662F;&amp;#xFF0C;&amp;#x8DD1;&amp;#x51CF;&amp;#x53BB;&amp;#x6B63;&amp;#x5728;&amp;#x8DD1;&amp;#x548C;&amp;#x770B;&amp;#x51CF;&amp;#x53BB;&amp;#x6B63;&amp;#x5728;&amp;#x770B;&amp;#x7684;&amp;#x503C;&amp;#x8FD1;&amp;#x4F3C;&amp;#x3002;&amp;#x8FD9;&amp;#x5353;&amp;#x660E;&amp;#x6A21;&amp;#x578B;&amp;#x4E0D;&amp;#x4EC5;&amp;#x5B66;&amp;#x4E60;&amp;#x4E86;&amp;#x5355;&amp;#x8BCD;&amp;#x7684;&amp;#x610F;&amp;#x601D;&amp;#x548C;&amp;#x8BED;&amp;#x4E49;&amp;#xFF0C;&amp;#x8FD8;&amp;#x5B66;&amp;#x4E60;&amp;#x4E86;&amp;#x4E00;&amp;#x5B9A;&amp;#x7A0B;&amp;#x5EA6;&amp;#x7684;&amp;#x53E5;&amp;#x6CD5;&amp;#x548C;&amp;#x8BED;&amp;#x6CD5;&amp;#x3002;&lt;br&gt;&lt;img src=&quot;/2016/05/30/Ten-Deep-Learning-Terms/10DLT-10DLT-WE.png&quot; alt=&quot;10DLT-WE&quot;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x7FFB;&amp;#x8BD1;&amp;#x81EA;&amp;#xFF1A; &lt;a href=&quot;http://www.datasciencecentral.com/profiles/blogs/10-deep-learning-terms-explained-in-simple-english&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;http://www.datasciencecentral.com/profiles/blogs/10-deep-learning-terms-explained-in-simple-english&lt;/a&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;h3 id=&quot;&amp;#x611F;&amp;#x77E5;&amp;#x5668;&amp;#xFF08;Perceptron&amp;#xFF09;&quot;&gt;&lt;a href=&quot;#&amp;#x611F;&amp;#x77E5;&amp;#x5668;&amp;#xFF08;Perceptron&amp;#xFF09;&quot; class=&quot;headerlink&quot;
    
    </summary>
    
    
      <category term="机器学习 深度学习" scheme="http://yoursite.com/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0-%E6%B7%B1%E5%BA%A6%E5%AD%A6%E4%B9%A0/"/>
    
  </entry>
  
  <entry>
    <title>图片引用测试</title>
    <link href="http://yoursite.com/2016/05/27/secondblog/"/>
    <id>http://yoursite.com/2016/05/27/secondblog/</id>
    <published>2016-05-27T07:39:25.000Z</published>
    <updated>2016-05-30T02:56:40.932Z</updated>
    
    <content type="html">&lt;p&gt;&lt;img src=&quot;/2016/05/27/secondblog/10DLT-CNN.png&quot; alt=&quot;what what&quot;&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;p&gt;&lt;img src=&quot;/2016/05/27/secondblog/10DLT-CNN.png&quot; alt=&quot;what what&quot;&gt;&lt;/p&gt;

    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>firstblog</title>
    <link href="http://yoursite.com/2016/05/11/firstblog/"/>
    <id>http://yoursite.com/2016/05/11/firstblog/</id>
    <published>2016-05-11T07:19:35.000Z</published>
    <updated>2016-05-11T07:19:35.183Z</updated>
    
    <content type="html"></content>
    
    <summary type="html">
    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>Hello World</title>
    <link href="http://yoursite.com/2016/05/11/hello-world/"/>
    <id>http://yoursite.com/2016/05/11/hello-world/</id>
    <published>2016-05-11T03:19:06.745Z</published>
    <updated>2016-05-11T03:19:06.748Z</updated>
    
    <content type="html">&lt;p&gt;Welcome to &lt;a href=&quot;https://hexo.io/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Hexo&lt;/a&gt;! This is your very first post. Check &lt;a href=&quot;https://hexo.io/docs/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;documentation&lt;/a&gt; for more info. If you get any problems when using Hexo, you can find the answer in &lt;a href=&quot;https://hexo.io/docs/troubleshooting.html&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;troubleshooting&lt;/a&gt; or you can ask me on &lt;a href=&quot;https://github.com/hexojs/hexo/issues&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;GitHub&lt;/a&gt;.&lt;/p&gt;
&lt;h2 id=&quot;Quick-Start&quot;&gt;&lt;a href=&quot;#Quick-Start&quot; class=&quot;headerlink&quot; title=&quot;Quick Start&quot;&gt;&lt;/a&gt;Quick Start&lt;/h2&gt;&lt;h3 id=&quot;Create-a-new-post&quot;&gt;&lt;a href=&quot;#Create-a-new-post&quot; class=&quot;headerlink&quot; title=&quot;Create a new post&quot;&gt;&lt;/a&gt;Create a new post&lt;/h3&gt;&lt;figure class=&quot;highlight bash&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo new &lt;span class=&quot;string&quot;&gt;&amp;quot;My New Post&amp;quot;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;More info: &lt;a href=&quot;https://hexo.io/docs/writing.html&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Writing&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&quot;Run-server&quot;&gt;&lt;a href=&quot;#Run-server&quot; class=&quot;headerlink&quot; title=&quot;Run server&quot;&gt;&lt;/a&gt;Run server&lt;/h3&gt;&lt;figure class=&quot;highlight bash&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo server&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;More info: &lt;a href=&quot;https://hexo.io/docs/server.html&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Server&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&quot;Generate-static-files&quot;&gt;&lt;a href=&quot;#Generate-static-files&quot; class=&quot;headerlink&quot; title=&quot;Generate static files&quot;&gt;&lt;/a&gt;Generate static files&lt;/h3&gt;&lt;figure class=&quot;highlight bash&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo generate&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;More info: &lt;a href=&quot;https://hexo.io/docs/generating.html&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Generating&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&quot;Deploy-to-remote-sites&quot;&gt;&lt;a href=&quot;#Deploy-to-remote-sites&quot; class=&quot;headerlink&quot; title=&quot;Deploy to remote sites&quot;&gt;&lt;/a&gt;Deploy to remote sites&lt;/h3&gt;&lt;figure class=&quot;highlight bash&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo deploy&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;More info: &lt;a href=&quot;https://hexo.io/docs/deployment.html&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Deployment&lt;/a&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;p&gt;Welcome to &lt;a href=&quot;https://hexo.io/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Hexo&lt;/a&gt;! This is your very first post. Check &lt;a href=&quot;https://hexo.
    
    </summary>
    
    
  </entry>
  
</feed>
