<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <title>【转】七个对我最重要的职业建议（译文） | Today is a new day</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x4E03;&amp;#x4E2A;&amp;#x5BF9;&amp;#x6211;&amp;#x6700;&amp;#x597D;&amp;#x7684;&amp;#x804C;&amp;#x4E1A;&amp;#x5EFA;&amp;#x8BAE;&amp;#xFF08;&amp;#x7CBE;&amp;#x7B80;&amp;#x7248;&amp;#xFF09;&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;Nicholas C. Zakas&amp;#x8BD1;&amp;#x8005;&amp;#xFF1A;&amp;#x962">
<meta property="og:type" content="article">
<meta property="og:title" content="【转】七个对我最重要的职业建议（译文）">
<meta property="og:url" content="http://yoursite.com/2016/07/28/TipsOfCareer/index.html">
<meta property="og:site_name" content="Today is a new day">
<meta property="og:description" content="&amp;#x4E03;&amp;#x4E2A;&amp;#x5BF9;&amp;#x6211;&amp;#x6700;&amp;#x597D;&amp;#x7684;&amp;#x804C;&amp;#x4E1A;&amp;#x5EFA;&amp;#x8BAE;&amp;#xFF08;&amp;#x7CBE;&amp;#x7B80;&amp;#x7248;&amp;#xFF09;&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;Nicholas C. Zakas&amp;#x8BD1;&amp;#x8005;&amp;#xFF1A;&amp;#x962">
<meta property="og:updated_time" content="2016-07-28T06:32:55.096Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="【转】七个对我最重要的职业建议（译文）">
<meta name="twitter:description" content="&amp;#x4E03;&amp;#x4E2A;&amp;#x5BF9;&amp;#x6211;&amp;#x6700;&amp;#x597D;&amp;#x7684;&amp;#x804C;&amp;#x4E1A;&amp;#x5EFA;&amp;#x8BAE;&amp;#xFF08;&amp;#x7CBE;&amp;#x7B80;&amp;#x7248;&amp;#xFF09;&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;Nicholas C. Zakas&amp;#x8BD1;&amp;#x8005;&amp;#xFF1A;&amp;#x962">
  
    <link rel="alternative" href="/atom.xml" title="Today is a new day" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/css/style.css">
</head>

<body>
  <div id="container">
    <div class="left-col">
    <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="/images/avatar.jpg" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">Carrot</a></h1>
		</hgroup>

		
		<p class="header-subtitle">小智慧，大收获</p>
		

		
			<div class="switch-btn">
				<div class="icon">
					<div class="icon-ctn">
						<div class="icon-wrap icon-house" data-idx="0">
							<div class="birdhouse"></div>
							<div class="birdhouse_holes"></div>
						</div>
						<div class="icon-wrap icon-ribbon hide" data-idx="1">
							<div class="ribbon"></div>
						</div>
						
						
						<div class="icon-wrap icon-me hide" data-idx="3">
							<div class="user"></div>
							<div class="shoulder"></div>
						</div>
						
					</div>
					
				</div>
				<div class="tips-box hide">
					<div class="tips-arrow"></div>
					<ul class="tips-inner">
						<li>菜单</li>
						<li>标签</li>
						
						
						<li>关于我</li>
						
					</ul>
				</div>
			</div>
		

		<div class="switch-area">
			<div class="switch-wrap">
				<section class="switch-part switch-part1">
					<nav class="header-menu">
						<ul>
						
							<li><a href="/">主页</a></li>
				        
							<li><a href="/archives">所有文章</a></li>
				        
							<li><a href="/wiki">Wiki</a></li>
				        
						</ul>
					</nav>
					<nav class="header-nav">
						<div class="social">
							
								<a class="github" target="_blank" href="https://github.com/eurekahc" title="github">github</a>
					        
								<a class="weibo" target="_blank" href="#" title="weibo">weibo</a>
					        
								<a class="rss" target="_blank" href="#" title="rss">rss</a>
					        
								<a class="zhihu" target="_blank" href="#" title="zhihu">zhihu</a>
					        
						</div>
					</nav>
				</section>
				
				
				<section class="switch-part switch-part2">
					<div class="widget tagcloud" id="js-tagcloud">
						<a href="/tags/Java/" style="font-size: 10px;">Java</a> <a href="/tags/raspberrypi/" style="font-size: 10px;">raspberrypi</a> <a href="/tags/sublime/" style="font-size: 10px;">sublime</a> <a href="/tags/机器学习/" style="font-size: 20px;">机器学习</a> <a href="/tags/深度学习/" style="font-size: 10px;">深度学习</a>
					</div>
				</section>
				
				
				

				
				
				<section class="switch-part switch-part3">
				
					<div id="js-aboutme">一只爱吃肉，不爱吃胡萝卜的兔子。</div>
				</section>
				
			</div>
		</div>
	</header>				
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"></div>
  		<h1 class="header-author js-mobile-header hide">Carrot</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
			
				<img lazy-src="/images/avatar.jpg" class="js-avatar">
			
			</div>
			<hgroup>
			  <h1 class="header-author">Carrot</h1>
			</hgroup>
			
			<p class="header-subtitle">小智慧，大收获</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/wiki">Wiki</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/eurekahc" title="github">github</a>
			        
						<a class="weibo" target="_blank" href="#" title="weibo">weibo</a>
			        
						<a class="rss" target="_blank" href="#" title="rss">rss</a>
			        
						<a class="zhihu" target="_blank" href="#" title="zhihu">zhihu</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-TipsOfCareer" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/07/28/TipsOfCareer/" class="article-date">
  	<time datetime="2016-07-28T06:28:38.000Z" itemprop="datePublished">2016-07-28</time>
</a>
    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      【转】七个对我最重要的职业建议（译文）
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        
        

        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <blockquote>
<p>&#x4E03;&#x4E2A;&#x5BF9;&#x6211;&#x6700;&#x597D;&#x7684;&#x804C;&#x4E1A;&#x5EFA;&#x8BAE;&#xFF08;&#x7CBE;&#x7B80;&#x7248;&#xFF09;<br>&#x4F5C;&#x8005;&#xFF1A;Nicholas C. Zakas<br>&#x8BD1;&#x8005;&#xFF1A;&#x962E;&#x4E00;&#x5CF0;<br>&#x539F;&#x6587;&#x7F51;&#x5740;&#xFF1A;<a href="https://www.nczonline.net/blog/2013/10/15/the-best-career-advice-ive-received/" target="_blank" rel="external">https://www.nczonline.net/blog/2013/10/15/the-best-career-advice-ive-received/</a></p>
</blockquote>
<p>Nicholas C. Zakas &#x662F;&#x5168;&#x4E16;&#x754C;&#x6700;&#x8457;&#x540D;&#x7684; JavaScript &#x7A0B;&#x5E8F;&#x5458;&#x4E4B;&#x4E00;&#x3002;<br>&#x4E24;&#x5E74;&#x524D;&#xFF0C;&#x4ED6;&#x5199;&#x4E86;&#x4E00;&#x7BC7;&#x957F;&#x6587;&#xFF0C;&#x56DE;&#x987E;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#xFF0C;&#x63D0;&#x5230;&#x4E03;&#x4E2A;&#x5BF9;&#x4ED6;&#x6765;&#x8BF4;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5EFA;&#x8BAE;&#x3002;</p>
<p><strong>&#x6211;&#x8BFB;&#x5B8C;&#x5F88;&#x53D7;&#x542F;&#x53D1;&#xFF0C;&#x51B3;&#x5B9A;&#x505A;&#x4E00;&#x70B9;&#x6458;&#x5F55;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x8BFB;&#x4E0B;&#x9762;&#x7684;&#x7CBE;&#x7B80;&#x7248;&#xFF0C;&#x518D;&#x53BB;&#x8BFB;&#x5168;&#x6587;&#x3002;</strong></p>
<h3 id="&#x4E00;&#x3001;&#x4E0D;&#x8981;&#x522B;&#x4EBA;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x505A;&#x4EC0;&#x4E48;"><a href="#&#x4E00;&#x3001;&#x4E0D;&#x8981;&#x522B;&#x4EBA;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x505A;&#x4EC0;&#x4E48;" class="headerlink" title="&#x4E00;&#x3001;&#x4E0D;&#x8981;&#x522B;&#x4EBA;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x505A;&#x4EC0;&#x4E48;"></a>&#x4E00;&#x3001;&#x4E0D;&#x8981;&#x522B;&#x4EBA;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x505A;&#x4EC0;&#x4E48;</h3><p>&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EA;&#x5E72;&#x4E86;8&#x4E2A;&#x6708;&#xFF0C;&#x90A3;&#x5BB6;&#x516C;&#x53F8;&#x5C31;&#x5012;&#x95ED;&#x4E86;&#x3002;&#x6211;&#x95EE;&#x7ECF;&#x7406;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x201C;&#x5C0F;&#x4F19;&#x5B50;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5F53;&#x4E00;&#x4E2A;&#x88AB;&#x4EBA;&#x70B9;&#x83DC;&#x7684;&#x53A8;&#x5E08;&#xFF0C;&#x522B;&#x4EBA;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x5C31;&#x70E7;&#x4EC0;&#x4E48;&#x3002;&#x4E0D;&#x8981;&#x63A5;&#x53D7;&#x90A3;&#x6837;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x522B;&#x4EBA;&#x4E0B;&#x547D;&#x4EE4;&#x4F60;&#x8BE5;&#x5E72;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x600E;&#x4E48;&#x5E72;&#x3002;&#x4F60;&#x8981;&#x53BB;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x90A3;&#x91CC;&#x7684;&#x4EBA;&#x80AF;&#x5B9A;&#x4F60;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x76F8;&#x4FE1;&#x4F60;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x653E;&#x624B;&#x8BA9;&#x4F60;&#x53BB;&#x505A;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x6211;&#x4ECE;&#x6B64;&#x660E;&#x767D;&#xFF0C;&#x5355;&#x5355;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x4F60;&#x8FD8;&#x5FC5;&#x987B;&#x53C2;&#x4E0E;&#x51B3;&#x5B9A;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x3002;&#x597D;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x670D;&#x4ECE;&#x547D;&#x4EE4;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x7ED9;&#x51FA;&#x53CD;&#x9988;&#xFF0C;&#x5E2E;&#x52A9;&#x4EA7;&#x54C1;&#x7684;&#x62E5;&#x6709;&#x8005;&#x6539;&#x8FDB;&#x5B83;&#x3002;</p>
<h3 id="&#x4E8C;&#x3001;&#x63A8;&#x9500;&#x81EA;&#x5DF1;"><a href="#&#x4E8C;&#x3001;&#x63A8;&#x9500;&#x81EA;&#x5DF1;" class="headerlink" title="&#x4E8C;&#x3001;&#x63A8;&#x9500;&#x81EA;&#x5DF1;"></a>&#x4E8C;&#x3001;&#x63A8;&#x9500;&#x81EA;&#x5DF1;</h3><p>&#x6211;&#x8FDB;&#x5165;&#x96C5;&#x864E;&#x516C;&#x53F8;&#x4EE5;&#x540E;&#xFF0C;&#x7ECF;&#x7406;&#x6709;&#x4E00;&#x5929;&#x8DDF;&#x6211;&#x8C08;&#x8BDD;&#xFF0C;&#x4ED6;&#x89C9;&#x5F97;&#x6211;&#x8FD8;&#x505A;&#x5F97;&#x4E0D;&#x591F;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x4F60;&#x5DE5;&#x4F5C;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x4EE3;&#x7801;&#x770B;&#x4E0A;&#x53BB;&#x4E0D;&#x9519;&#xFF0C;&#x5F88;&#x5C11;&#x51FA;Bug&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x522B;&#x4EBA;&#x90FD;&#x6CA1;&#x770B;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x5176;&#x4ED6;&#x4EBA;&#x76F8;&#x4FE1;&#x4F60;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x8BA9;&#x522B;&#x4EBA;&#x77E5;&#x9053;&#x4F60;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x4F60;&#x9700;&#x8981;&#x63A8;&#x9500;&#x81EA;&#x5DF1;&#xFF0C;&#x5F15;&#x8D77;&#x522B;&#x4EBA;&#x7684;&#x6CE8;&#x610F;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x6211;&#x8FD9;&#x624D;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x5373;&#x4F7F;&#x505A;&#x51FA;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x522B;&#x4EBA;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4E5F;&#x6CA1;&#x7528;&#x3002;&#x505A;&#x4E00;&#x4E2A;&#x89D2;&#x843D;&#x91CC;&#x9759;&#x9759;&#x7F16;&#x7801;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5E76;&#x4E0D;&#x53EF;&#x53D6;&#x3002;&#x4F60;&#x7684;&#x4E3B;&#x7BA1;&#x4F1A;&#x652F;&#x6301;&#x4F60;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x6CA1;&#x6CD5;&#x66FF;&#x4F60;&#x5BA3;&#x4F20;&#x3002;&#x516C;&#x53F8;&#x7684;&#x5176;&#x4ED6;&#x4EBA;&#x9700;&#x8981;&#x660E;&#x767D;&#x4F60;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x544A;&#x8BC9;&#x522B;&#x4EBA;&#x4F60;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x4E00;&#x5C01;&#x7B80;&#x5355;&#x7684;Email&#xFF1A;&#x201D;&#x55E8;&#xFF0C;&#x6211;&#x5B8C;&#x6210;&#x4E86;XXX&#xFF0C;&#x6B22;&#x8FCE;&#x5C06;&#x4F60;&#x7684;&#x60F3;&#x6CD5;&#x544A;&#x8BC9;&#x6211;&#x201D;&#xFF0C;&#x5C31;&#x5F88;&#x7BA1;&#x7528;&#x3002;</p>
<h3 id="&#x4E09;&#x3001;&#x5B66;&#x4F1A;&#x5E26;&#x9886;&#x56E2;&#x961F;"><a href="#&#x4E09;&#x3001;&#x5B66;&#x4F1A;&#x5E26;&#x9886;&#x56E2;&#x961F;" class="headerlink" title="&#x4E09;&#x3001;&#x5B66;&#x4F1A;&#x5E26;&#x9886;&#x56E2;&#x961F;"></a>&#x4E09;&#x3001;&#x5B66;&#x4F1A;&#x5E26;&#x9886;&#x56E2;&#x961F;</h3><p>&#x5DE5;&#x4F5C;&#x51E0;&#x5E74;&#x540E;&#xFF0C;&#x5DF2;&#x7ECF;&#x6CA1;&#x4EBA;&#x6000;&#x7591;&#x6211;&#x7684;&#x6280;&#x672F;&#x80FD;&#x529B;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x77E5;&#x9053;&#x6211;&#x80FD;&#x5199;&#x51FA;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x53EF;&#x9760;&#x4EE3;&#x7801;&#x3002;&#x6709;&#x4E00;&#x6B21;&#xFF0C;&#x6211;&#x95EE;&#x4E3B;&#x7BA1;&#xFF0C;&#x600E;&#x4E48;&#x624D;&#x80FD;&#x5F97;&#x5230;&#x63D0;&#x5347;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x201C;&#x5F53;&#x4F60;&#x7684;&#x6280;&#x672F;&#x80FD;&#x529B;&#x8FC7;&#x5173;&#x4EE5;&#x540E;&#xFF0C;&#x5C31;&#x8981;&#x8003;&#x9A8C;&#x4F60;&#x4E0E;&#x4ED6;&#x4EBA;&#x76F8;&#x5904;&#x7684;&#x80FD;&#x529B;&#x4E86;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x81EA;&#x5DF1;&#x7F3A;&#x4E4F;&#x7684;&#x662F;&#x9886;&#x5BFC;&#x80FD;&#x529B;&#xFF0C;&#x5982;&#x4F55;&#x5E26;&#x9886;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x4E0E;&#x5176;&#x4ED6;&#x4EBA;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#xFF0C;&#x53D6;&#x5230;&#x66F4;&#x5927;&#x7684;&#x6210;&#x679C;&#x3002;</p>
<h3 id="&#x56DB;&#x3001;&#x751F;&#x6D3B;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;"><a href="#&#x56DB;&#x3001;&#x751F;&#x6D3B;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;" class="headerlink" title="&#x56DB;&#x3001;&#x751F;&#x6D3B;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;"></a>&#x56DB;&#x3001;&#x751F;&#x6D3B;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;</h3><p>&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x5728;&#x96C5;&#x864E;&#x516C;&#x53F8;&#x5F88;&#x6709;&#x632B;&#x6298;&#x611F;&#xFF0C;&#x5BF9;&#x516C;&#x53F8;&#x7684;&#x4E00;&#x4E9B;&#x505A;&#x6CD5;&#x4E0D;&#x8BA4;&#x540C;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x5BF9;&#x522B;&#x4EBA;&#x53D1;&#x706B;&#x3002;&#x6211;&#x95EE;&#x4E00;&#x4E2A;&#x540C;&#x4E8B;&#xFF0C;&#x4ED6;&#x600E;&#x4E48;&#x80FD;&#x5BF9;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x4FDD;&#x6301;&#x5E73;&#x9759;&#xFF0C;&#x4ED6;&#x56DE;&#x7B54;&#xFF1A;</p>
<blockquote>
<p>&#x201C;&#x4F60;&#x8981;&#x60F3;&#x901A;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x6709;&#x4EBA;&#x63D0;&#x4EA4;&#x4E86;&#x70C2;&#x4EE3;&#x7801;&#xFF0C;&#x7F51;&#x7AD9;&#x4E0B;&#x7EBF;&#x4E86;&#xFF0C;&#x53C8;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x5DE5;&#x4F5C;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x6D3B;&#x3002;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x662F;&#x5DE5;&#x4F5C;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x771F;&#x6B63;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x53D1;&#x751F;&#x5728;&#x5DE5;&#x4F5C;&#x4EE5;&#x5916;&#x3002;&#x6211;&#x56DE;&#x5230;&#x5BB6;&#xFF0C;&#x5BB6;&#x91CC;&#x4EBA;&#x6B63;&#x5728;&#x7B49;&#x6211;&#xFF0C;&#x8FD9;&#x624D;&#x91CD;&#x8981;&#x554A;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x4ECE;&#x6B64;&#xFF0C;&#x6211;&#x5C31;&#x628A;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x5206;&#x5F00;&#x4E86;&#xFF0C;&#x53EA;&#x628A;&#x5B83;&#x5F53;&#x4F5C;&#x201D;&#x5DE5;&#x4F5C;&#x95EE;&#x9898;&#x201D;&#x770B;&#x5F85;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x6211;&#x5BF9;&#x5DE5;&#x4F5C;&#x5C31;&#x603B;&#x80FD;&#x5FC3;&#x5E73;&#x6C14;&#x548C;&#xFF0C;&#x4E0E;&#x4EBA;&#x4EA4;&#x6D41;&#x4E5F;&#x66F4;&#x987A;&#x5229;&#x4E86;&#x3002;</p>
<h3 id="&#x4E94;&#x3001;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x9053;&#x8DEF;"><a href="#&#x4E94;&#x3001;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x9053;&#x8DEF;" class="headerlink" title="&#x4E94;&#x3001;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x9053;&#x8DEF;"></a>&#x4E94;&#x3001;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x9053;&#x8DEF;</h3><p>&#x6211;&#x88AB;&#x63D0;&#x5347;&#x4E3A;&#x4E3B;&#x7BA1;&#x4EE5;&#x540E;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x3002;&#x6211;&#x8BF7;&#x6559;&#x4E86;&#x4E0A;&#x7EA7;&#xFF0C;&#x4ED6;&#x56DE;&#x7B54;&#xFF1A;</p>
<blockquote>
<p>&#x201C;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x6211;&#x4EEC;&#x544A;&#x8BC9;&#x4F60;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x6211;&#x671F;&#x5F85;&#x4F60;&#x6765;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x505A;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x5F88;&#x591A;&#x5DE5;&#x7A0B;&#x5E08;&#x90FD;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x8F6C;&#x53D8;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x591F;&#x505A;&#x5230;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x8BF4;&#x660E;&#x4F60;&#x6210;&#x719F;&#x4E86;&#xFF0C;&#x5B66;&#x4F1A;&#x4E86;&#x53D6;&#x820D;&#x3002;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x628A;&#x65F6;&#x95F4;&#x82B1;&#x5728;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x4E0A;&#x9762;&#xFF0C;&#x5FC5;&#x987B;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x91CD;&#x70B9;&#x3002;</p>
<h3 id="&#x516D;&#x3001;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x6210;&#x4E3B;&#x4EBA;"><a href="#&#x516D;&#x3001;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x6210;&#x4E3B;&#x4EBA;" class="headerlink" title="&#x516D;&#x3001;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x6210;&#x4E3B;&#x4EBA;"></a>&#x516D;&#x3001;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x6210;&#x4E3B;&#x4EBA;</h3><p>&#x6211;&#x6BCF;&#x5929;&#x8981;&#x5F00;&#x5F88;&#x591A;&#x4F1A;&#xFF0C;&#x6709;&#x4E9B;&#x4F1A;&#x8BAE;&#x6211;&#x6839;&#x672C;&#x65E0;&#x8BDD;&#x53EF;&#x8BF4;&#x3002;&#x6211;&#x5BF9;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x8BF4;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x53C2;&#x52A0;&#x8FD9;&#x4E2A;&#x4F1A;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x8D21;&#x732E;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x201C;&#x4E0D;&#x8981;&#x518D;&#x53BB;&#x5F00;&#x8FD9;&#x6837;&#x7684;&#x4F1A;&#x4E86;&#x3002;&#x4F60;&#x53C2;&#x52A0;&#x4E00;&#x4E2A;&#x4F1A;&#xFF0C;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x53C2;&#x4E0E;&#x4E86;&#x67D0;&#x4EF6;&#x4E8B;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x786E;&#x5B9A;&#x81EA;&#x5DF1;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5728;&#x573A;&#xFF0C;&#x5C31;&#x505C;&#x4E0B;&#x6765;&#x95EE;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E0D;&#x9700;&#x8981;&#x4F60;&#xFF0C;&#x5C31;&#x79BB;&#x5F00;&#x3002;&#x4E0D;&#x8981;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x90FD;&#x9759;&#x9759;&#x5730;&#x53C2;&#x52A0;&#x4E00;&#x4E2A;&#x4F1A;&#xFF0C;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x6210;&#x8D1F;&#x8D23;&#x4EBA;&#xFF0C;&#x5927;&#x5BB6;&#x4F1A;&#x76F8;&#x4FE1;&#x4F60;&#x7684;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x4ECE;&#x90A3;&#x65F6;&#x8D77;&#xFF0C;&#x6211;&#x4ECE;&#x6CA1;&#x6709;&#x4E00;&#x58F0;&#x4E0D;&#x53D1;&#x5730;&#x53C2;&#x52A0;&#x4F1A;&#x8BAE;&#x3002;&#x6211;&#x786E;&#x4FDD;&#x53EA;&#x53C2;&#x52A0;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x6211;&#x53C2;&#x52A0;&#x7684;&#x4F1A;&#x8BAE;&#x3002;</p>
<h3 id="&#x4E03;&#x3001;&#x627E;&#x5230;&#x6C34;&#x5E73;&#x66F4;&#x9AD8;&#x7684;&#x4EBA;"><a href="#&#x4E03;&#x3001;&#x627E;&#x5230;&#x6C34;&#x5E73;&#x66F4;&#x9AD8;&#x7684;&#x4EBA;" class="headerlink" title="&#x4E03;&#x3001;&#x627E;&#x5230;&#x6C34;&#x5E73;&#x66F4;&#x9AD8;&#x7684;&#x4EBA;"></a>&#x4E03;&#x3001;&#x627E;&#x5230;&#x6C34;&#x5E73;&#x66F4;&#x9AD8;&#x7684;&#x4EBA;</h3><p>&#x6700;&#x540E;&#xFF0C;&#x8BA9;&#x6211;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x5386;&#x51FA;&#x53D1;&#xFF0C;&#x7ED9;&#x6211;&#x7684;&#x8BFB;&#x8005;&#x4E00;&#x4E2A;&#x5EFA;&#x8BAE;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x627E;&#x5230;&#x90A3;&#x4E9B;&#x6BD4;&#x4F60;&#x6C34;&#x5E73;&#x66F4;&#x9AD8;&#x3001;&#x66F4;&#x806A;&#x660E;&#x7684;&#x4EBA;&#xFF0C;&#x5C3D;&#x91CF;&#x548C;&#x4ED6;&#x4EEC;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5403;&#x996D;&#x6216;&#x8005;&#x559D;&#x5496;&#x5561;&#xFF0C;&#x5411;&#x4ED6;&#x4EEC;&#x8BA8;&#x6559;&#xFF0C;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x62E5;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x4F60;&#x7684;&#x804C;&#x4E1A;&#xFF0C;&#x751A;&#x81F3;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x90FD;&#x4F1A;&#x56E0;&#x6B64;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x201D;</p>
</blockquote>
<p>&#xFF08;&#x5B8C;&#xFF09;</p>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/08/16/rsbpi3-uart/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption"><</strong>
      <div class="article-nav-title">
        
          树莓派3串口通信
        
      </div>
    </a>
  
  
    <a href="/2016/07/26/win64-numpy/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">Win64安装Numpy</div>
      <strong class="article-nav-caption">></strong>
    </a>
  
</nav>

  
</article>








</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2016 Carrot
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    
  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">


<script>
	var yiliaConfig = {
		fancybox: true,
		mathjax: true,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false
	}
</script>
<script src="http://7.url.cn/edu/jslib/comb/require-2.1.6,jquery-1.9.1.min.js"></script>
<script src="/js/main.js"></script>






<script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
    }
});

MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';                 
    }       
});
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>


  </div>
</body>
</html>